## Terraform Plan
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                NAME                                                 |
|----------|-----------------------------------------------------------------------------------------------------|
| add      | `module.saas_app_service_principal.azurerm_role_assignment.role_assignment_sp[0]`                   |
| recreate | `azurerm_monitor_action_group.SRE_GR_AG`                                                            |
|          | `module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this`      |
|          | `module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_monitor_action_group.SRE_GR_AG must be replaced
-/+ resource "azurerm_monitor_action_group" "SRE_GR_AG" {
      ~ id                  = "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/actionGroups/SRE-GR-AG" -> (known after apply)
        name                = "SRE-GR-AG"
      ~ resource_group_name = "pubsec-central-logging-rg-prod" -> "cds-snc-mgmt" # forces replacement
        tags                = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
            "ssc_cbrid"          = "21JA"
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "this" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/scheduledQueryRules/Breakglass Account Signin Attempt" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "Breakglass Account Signin Attempt"
      ~ resource_group_name                    = "pubsec-central-logging-rg-prod" -> "cds-snc-mgmt" # forces replacement
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.OperationalInsights/workspaces/log-analytics-workspace-prod" -> "/subscriptions/6881deca-df81-4b95-ad54-103b0b100a1d/resourceGroups/cds-snc-mgmt/providers/Microsoft.OperationalInsights/workspaces/cds-snc-la",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
            "ssc_cbrid"          = "21JA"
        }
      - target_resource_types                  = [] -> null
        # (11 unchanged attributes hidden)

      ~ action {
          ~ action_groups     = [
              - "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/actionGroups/SRE-GR-AG",
            ] -> (known after apply)
          - custom_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "this" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/scheduledQueryRules/Conditional Access Policy Modification" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "Conditional Access Policy Modification"
      ~ resource_group_name                    = "pubsec-central-logging-rg-prod" -> "cds-snc-mgmt" # forces replacement
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.OperationalInsights/workspaces/log-analytics-workspace-prod" -> "/subscriptions/6881deca-df81-4b95-ad54-103b0b100a1d/resourceGroups/cds-snc-mgmt/providers/Microsoft.OperationalInsights/workspaces/cds-snc-la",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
            "ssc_cbrid"          = "21JA"
        }
      - target_resource_types                  = [] -> null
        # (11 unchanged attributes hidden)

      ~ action {
          ~ action_groups     = [
              - "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/actionGroups/SRE-GR-AG",
            ] -> (known after apply)
          - custom_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.saas_app_service_principal.azurerm_role_assignment.role_assignment_sp[0] will be created
  + resource "azurerm_role_assignment" "role_assignment_sp" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5b4dea77-d623-4fbf-95ba-f1fe398bf7a2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/0bbd06bc-48ac-48bc-9275-c0cbeebef3b6"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["azurerm_monitor_action_group.SRE_GR_AG"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this"]
WARN - plan.json - main - Missing Common Tags: ["module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_app_service_principal.azuread_application.sp_app[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_app_service_principal.azuread_service_principal.sp[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_resource_group.rg"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
